<script setup lang="ts">
import FifthTitle from '../common/Title/FifthTitle.vue'
import Card from '../common/Card.vue'
import SecondTitle from '../common/Title/SecondTitle.vue'
import RankList from '../common/RankList/RankList.vue'
import HotWordCloud from '../Echart/HotWordCloud.vue'

const props = withDefaults(
  defineProps<{
    industryLabel: string
    industryLevel: string
  }>(),
  {
    industryLabel: '',
    industryLevel: '1',
  }
)

const zhuanyeData = ref([
  {
    name: '网约配送员',
    value: 1722721,
    group: 1,
  },
  {
    name: '营销员',
    value: 1594630,
    group: 2,
  },
  {
    name: '理货员',
    value: 1490752,
    group: 3,
  },
  {
    name: '客户服务管理员',
    value: 1352604,
    group: 4,
  },
  {
    name: '客运车辆驾驶员',
    value: 986546,
    group: 5,
  },
  {
    name: '仓储管理员',
    value: 839964,
    group: 6,
  },
  {
    name: '市场营销专业人员',
    value: 284842,
    group: 7,
  },
  {
    name: '秘书',
    value: 218532,
    group: 8,
  },
  {
    name: '互联网营销师',
    value: 206686,
    group: 9,
  },
  {
    name: '道路货运汽车驾驶员',
    value: 194485,
    group: 10,
  },
  {
    name: '计算机软件工程技术人员',
    value: 173696,
    group: 11,
  },
  {
    name: '人力资源管理专业人员',
    value: 165098,
    group: 12,
  },
  {
    name: '装卸搬运工',
    value: 159512,
    group: 13,
  },
  {
    name: '企业经理',
    value: 151841,
    group: 14,
  },
  {
    name: '招聘师',
    value: 147519,
    group: 15,
  },
  {
    name: '通信工程技术人员',
    value: 141000,
    group: 16,
  },
  {
    name: '信息系统运行维护工程技术人员',
    value: 135345,
    group: 17,
  },
  {
    name: '物流服务师',
    value: 126325,
    group: 18,
  },
  {
    name: '会计专业人员',
    value: 124759,
    group: 19,
  },
  {
    name: '商务策划专业人员',
    value: 117508,
    group: 20,
  },
])

const hotWordsData = ref([
  {
    name: '市场调查与统计分析',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '连锁经营与管理',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '药品营销',
    value: 1594630,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '航海技术',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流管理',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '铁路物流管理',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '港口物流管理',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '水路运输服务',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '外轮理货',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '水运业务',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流',
    value: 1490752,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '市场营销',
    value: 1352604,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '通信运营服务',
    value: 1352604,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '市场营销',
    value: 1352604,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '烟草栽培与加工技术',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食储运与质量安全',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食工程',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '烟草栽培与加工',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮油储运与检验技术',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食工程',
    value: 839964,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '行政管理',
    value: 218532,
    industrys: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '现代文秘',
    value: 218532,
    industrys: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '文秘',
    value: 218532,
    industrys: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '行政事务助理',
    value: 218532,
    industrys: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '全媒体电商运营',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '市场营销',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '电子商务',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销与直播电商',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络直播与运营',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '市场营销',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '电子商务',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '直播电商服务',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    industrys: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '智能网联汽车技术',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '汽车保险理赔与评估',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '交通运营服务',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '国际货运代理',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '汽车保险理赔与评估',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '智能网联汽车技术应用',
    value: 194485,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '软件工程',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机应用工程',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '软件工程技术',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机程序设计',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '软件技术',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机程序设计',
    value: 173696,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    industrys: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    industrys: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '劳动与社会保障',
    value: 165098,
    industrys: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    industrys: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '港口机械操作与维护',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '起重装卸机械操作与维修',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械智能控制',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械操作与维护',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '起重装卸机械操作与维修',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械智能控制',
    value: 159512,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '人力资源管理',
    value: 147519,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    industrys: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '通信工程',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络工程技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代通信工程',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信终端设备制造与维修',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机网络应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信网络应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业互联网技术应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '轨道交通通信信号设备制造与维护',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '铁道通信与信息化技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '民航通信技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '城市轨道交通通信信号技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机网络技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代通信技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代移动通信技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信软件技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信工程设计与监理',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信系统运行管理',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络规划与优化技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '电信服务与管理',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信终端设备制造与维修',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业网络技术',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机信息管理',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信网络应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信运营服务',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络与信息安全',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '云计算技术应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业互联网技术应用',
    value: 141000,
    industrys: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '电气工程及其自动化',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '电子信息工程',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '信息管理与信息系统',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '软件工程技术',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '信息安全与管理',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '计算机信息管理',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '智能物流技术',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '司法信息技术',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '计算机信息管理',
    value: 135345,
    industrys: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程技术',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '道路运输管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程技术',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '铁路物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '冷链物流技术与管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '港口物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '工程物流管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '采购与供应管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '智能物流技术',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '供应链运营',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品营销',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品服务与管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '水路运输服务',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流服务与管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '冷链物流服务与管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '国际货运代理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流设施运行与维护',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '水运业务',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品营销',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品服务与管理',
    value: 126325,
    industrys: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '大数据与财务管理',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与会计',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与财务管理',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与会计',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '会计信息管理',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '统计与会计核算',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '会计',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '财务管理',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '农村经济综合管理',
    value: 124759,
    industrys: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '商务英语',
    value: 117508,
    industrys: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
  {
    name: '国际商务',
    value: 117508,
    industrys: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
  {
    name: '商务管理',
    value: 117508,
    industrys: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
])
</script>

<template>
  <div class="w-full h-full mt-4">
    <div v-if="!industryLabel" class="grid grid-cols-2 gap-4">
      <div class="flex flex-col gap-4 bg-white/5 backdrop-blur-sm rounded-lg p-4">
        <FifthTitle
          title="标准行业 TOP100 排行"
          subtext="(热门标准行业、高薪标准行业)"
          type="circle"
          size="md"
          icon="icon-paihang"
        />
        <div class="grid grid-cols-2 gap-4 text-white/75">
          <Card>
            <SecondTitle
              title="热门标准行业 TOP100"
              type="circle"
              subtext="按招聘人数排行"
              icon="icon-remen"
              icon-size="18"
            />
            <RankList
              :data="zhuanyeData"
              tooltip-title="学生人数"
              unit="人"
              :show-count="10"
              period="5"
            />
          </Card>
          <Card>
            <SecondTitle
              title="高薪标准行业 TOP100"
              type="circle"
              subtext="按薪资中位数排行"
              icon="icon-qiandai"
              icon-size="18"
            />
            <RankList
              :data="zhuanyeData"
              tooltip-title="学生人数"
              unit="人"
              :show-count="10"
              period="5"
            />
          </Card>
        </div>
      </div>
    </div>
    <div v-else class="grid grid-cols-3 gap-4">
      <Card>
        <SecondTitle
          :title="industryLabel + '行业概述'"
          type="circle"
          icon="icon-a-tishi3"
          icon-size="28"
        />
        <div class="flex flex-col h-[320px] overflow-y-auto">
          <div class="p-2 space-y-2 text-white/75 text-sm">
            <div class="font-bold text-white mt-2">行业分类</div>
            <div class="flex flex-col gap-1">
              <div class="flex items-center">
                <span
                  class="w-2 h-2 bg-white/75 rounded-full inline-block mr-2 flex-shrink-0"
                ></span>
                <span class="whitespace-nowrap font-medium text-gray-200">行业分类大典大类：</span>
              </div>
              <div class="flex text-xs">
                {{ industryLabel }}
              </div>
            </div>
            <div v-if="Number(industryLevel) >= 2" class="flex flex-col gap-1">
              <div class="flex items-center">
                <span
                  class="w-2 h-2 bg-white/75 rounded-full inline-block mr-2 flex-shrink-0"
                ></span>
                <span class="whitespace-nowrap font-medium text-gray-200">行业分类大典中类：</span>
              </div>
              <div class="flex text-xs">
                {{ industryLabel }}
              </div>
            </div>
            <div v-if="Number(industryLevel) >= 3" class="flex flex-col gap-1">
              <div class="flex items-center">
                <span
                  class="w-2 h-2 bg-white/75 rounded-full inline-block mr-2 flex-shrink-0"
                ></span>
                <span class="whitespace-nowrap font-medium text-gray-200">行业分类大典小类：</span>
              </div>
              <div class="flex text-xs">
                {{ industryLabel }}
              </div>
            </div>
            <div v-if="Number(industryLevel) >= 4" class="flex flex-col gap-1">
              <div class="flex items-center">
                <span
                  class="w-2 h-2 bg-white/75 rounded-full inline-block mr-2 flex-shrink-0"
                ></span>
                <span class="whitespace-nowrap font-medium text-gray-200">行业分类大典细类：</span>
              </div>
              <div class="flex text-xs">
                {{ industryLabel }}
              </div>
            </div>
          </div>
          <div class="p-2 space-y-2 text-white/75 text-sm">
            <div class="font-bold text-white mt-2">行业概述</div>
            <div class="text-xs">
              在最高人民法院、 最高人民检察院、 地 方各级人民法院以及专门人民法院、 地方各
              级人民检察院以及专门人民检察院中, 担任 领导职务并具有决策、 管理职权的人员。
              本小类包括下列行业: 1-02-05-01 人民法院负责人 1-02-05-02 人民检察院负责人
            </div>
          </div>
        </div>
      </Card>
      <Card>
        <SecondTitle
          :title="industryLabel + '行业对应的专业词'"
          type="circle"
          icon="icon-zhuanye"
          icon-size="18"
        />
        <div class="text-white/80 h-[320px] flex-1">
          <HotWordCloud tooltip-title="高薪标准行业" :data="hotWordsData" :height="320" />
        </div>
      </Card>
    </div>
  </div>
</template>
