<script setup lang="ts">
import Card from '../common/Card.vue'
import FirstTitle from '../common/Title/FirstTitle.vue'
import SecondTitle from '../common/Title/SecondTitle.vue'
import FifthTitle from '../common/Title/FifthTitle.vue'
import RankList from '../common/RankList/RankList.vue'
import HotWordCloud from '../Echart/HotWordCloud.vue'
import GradientBarChart from '../Echart/GradientBarChart.vue'

withDefaults(
  defineProps<{
    province: string
    time: string
    scope: string
  }>(),
  {
    province: '全国',
    time: 'month',
    scope: 'all',
  }
)

const zhuanyeData = ref([
  {
    name: '专业1',
    value: 100,
  },
  {
    name: '专业2',
    value: 200,
  },
  {
    name: '专业3',
    value: 300,
  },
  {
    name: '专业4',
    value: 400,
  },
  {
    name: '专业5',
    value: 500,
  },
  {
    name: '专业6',
    value: 600,
  },
  {
    name: '专业7',
    value: 700,
  },
  {
    name: '专业8',
    value: 800,
  },
  {
    name: '专业9',
    value: 900,
  },
  {
    name: '专业10',
    value: 1000,
  },
])

const handleClick = () => {
  useRouter().push('/education-major-list')
}

const hotWordsData = ref([
  {
    name: '市场调查与统计分析',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '连锁经营与管理',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '市场营销',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '药品营销',
    value: 1594630,
    careers: ['商业、服务业人员', '批发与零售服务人员', '销售人员', '营销员'],
  },
  {
    name: '航海技术',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流管理',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '铁路物流管理',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '港口物流管理',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '水路运输服务',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '外轮理货',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '水运业务',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '航空物流',
    value: 1490752,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '理货员',
    ],
  },
  {
    name: '市场营销',
    value: 1352604,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '通信运营服务',
    value: 1352604,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '市场营销',
    value: 1352604,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '商务咨询服务人员', '客户服务管理员'],
  },
  {
    name: '烟草栽培与加工技术',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食储运与质量安全',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食工程',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '烟草栽培与加工',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮油储运与检验技术',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '粮食工程',
    value: 839964,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '仓储管理员',
    ],
  },
  {
    name: '行政管理',
    value: 218532,
    careers: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '现代文秘',
    value: 218532,
    careers: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '文秘',
    value: 218532,
    careers: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '行政事务助理',
    value: 218532,
    careers: ['办事人员和有关人员', '行政办事及辅助人员', '行政事务处理人员', '秘书'],
  },
  {
    name: '全媒体电商运营',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '市场营销',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '电子商务',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销与直播电商',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络直播与运营',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '市场营销',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '电子商务',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '直播电商服务',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '网络营销',
    value: 206686,
    careers: ['商业、服务业人员', '批发与零售服务人员', '电子商务服务人员', '互联网营销师'],
  },
  {
    name: '智能网联汽车技术',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '汽车保险理赔与评估',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '交通运营服务',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '国际货运代理',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '汽车保险理赔与评估',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '智能网联汽车技术应用',
    value: 194485,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '道路运输服务人员',
      '道路货运汽车驾驶员',
    ],
  },
  {
    name: '软件工程',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机应用工程',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '软件工程技术',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机程序设计',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '软件技术',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '计算机程序设计',
    value: 173696,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '计算机软件工程技术人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    careers: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    careers: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '劳动与社会保障',
    value: 165098,
    careers: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '人力资源管理',
    value: 165098,
    careers: ['专业技术人员', '经济和金融专业人员', '人力资源专业人员', '人力资源管理专业人员'],
  },
  {
    name: '港口机械操作与维护',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '起重装卸机械操作与维修',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械智能控制',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械操作与维护',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '起重装卸机械操作与维修',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '港口机械智能控制',
    value: 159512,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '装卸搬运和运输代理服务人员',
      '装卸搬运工',
    ],
  },
  {
    name: '人力资源管理',
    value: 147519,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '人力资源管理',
    value: 147519,
    careers: ['商业、服务业人员', '租赁和商务服务人员', '人力资源服务人员', '招聘师'],
  },
  {
    name: '通信工程',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络工程技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代通信工程',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信终端设备制造与维修',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机网络应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信网络应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业互联网技术应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '轨道交通通信信号设备制造与维护',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '铁道通信与信息化技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '民航通信技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '城市轨道交通通信信号技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机网络技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代通信技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '现代移动通信技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信软件技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信工程设计与监理',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信系统运行管理',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络规划与优化技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '电信服务与管理',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信终端设备制造与维修',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业网络技术',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '计算机信息管理',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信网络应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '通信运营服务',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '网络与信息安全',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '云计算技术应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '工业互联网技术应用',
    value: 141000,
    careers: ['专业技术人员', '工程技术人员', '信息和通信工程技术人员', '通信工程技术人员'],
  },
  {
    name: '电气工程及其自动化',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '电子信息工程',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '信息管理与信息系统',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '软件工程技术',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '信息安全与管理',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '计算机信息管理',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '智能物流技术',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '司法信息技术',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '计算机信息管理',
    value: 135345,
    careers: [
      '专业技术人员',
      '工程技术人员',
      '信息和通信工程技术人员',
      '信息系统运行维护工程技术人员',
    ],
  },
  {
    name: '物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程技术',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '道路运输管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流工程技术',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '铁路物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '冷链物流技术与管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '港口物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '工程物流管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '采购与供应管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '智能物流技术',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '供应链运营',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品营销',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品服务与管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '水路运输服务',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流服务与管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '冷链物流服务与管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '国际货运代理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '物流设施运行与维护',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '现代物流',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '水运业务',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '航空物流',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '农产品营销与储运',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品营销',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '药品服务与管理',
    value: 126325,
    careers: [
      '商业、服务业人员',
      '交通运输、仓储物流和邮政业服务人员',
      '仓储物流服务人员',
      '物流服务师',
    ],
  },
  {
    name: '大数据与财务管理',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与会计',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与财务管理',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '大数据与会计',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '会计信息管理',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '统计与会计核算',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '会计',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '财务管理',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '农村经济综合管理',
    value: 124759,
    careers: ['专业技术人员', '经济和金融专业人员', '会计专业人员', '会计专业人员'],
  },
  {
    name: '商务英语',
    value: 117508,
    careers: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
  {
    name: '国际商务',
    value: 117508,
    careers: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
  {
    name: '商务管理',
    value: 117508,
    careers: ['专业技术人员', '经济和金融专业人员', '商务专业人员', '商务策划专业人员'],
  },
])

const positionData = [
  { name: '专科', value: 750, rate: 10 },
  { name: '本科', value: 300, rate: 20 },
  { name: '研究生及以上', value: 600, rate: 0 },
  { name: '其他', value: 200, rate: -25 },
]
</script>

<template>
  <div class="w-full flex flex-col gap-4 mt-4">
    <div class="w-full flex flex-col gap-4 bg-white/10 rounded-lg p-4">
      <FifthTitle title="专业相关的信息" size="md" icon="icon-zhuanye" />
      <div class="w-full grid grid-cols-4 gap-4">
        <Card class="col-span-1">
          <SecondTitle
            title="专业排行"
            type="circle"
            icon="icon-paihang"
            :icon-size="20"
            subtext="按招聘人数对应的专业"
            show-text-button
            @click="handleClick"
          />
          <div class="relative flex flex-col flex-1 min-h-0 text-white/80">
            <RankList
              :data="zhuanyeData"
              tooltip-title="学生人数"
              unit="人"
              :show-count="10"
              period="5"
            />
          </div>
        </Card>
        <Card class="col-span-1">
          <SecondTitle
            title="专业排行"
            type="circle"
            icon="icon-paihang"
            :icon-size="20"
            subtext="按薪资中位数对应的专业"
            show-text-button
            @click="handleClick"
          />
          <div class="relative flex flex-col flex-1 min-h-0 text-white/80">
            <RankList
              :data="zhuanyeData"
              tooltip-title="学生人数"
              unit="人"
              :show-count="10"
              period="5"
            />
          </div>
        </Card>
        <Card class="col-span-1">
          <FirstTitle title="热门职业专业词云图" />
          <div class="relative flex flex-col flex-1 min-h-0 text-white/80">
            <HotWordCloud tooltip-title="热门标准职业" :data="hotWordsData" :height="320" />
          </div>
        </Card>
        <Card class="col-span-1">
          <FirstTitle title="高薪职业专业词云图" />
          <div class="relative flex flex-col flex-1 min-h-0 text-white/80">
            <HotWordCloud tooltip-title="高薪标准职业" :data="hotWordsData" :height="320" />
          </div>
        </Card>
      </div>
    </div>

    <div class="w-full gap-4 bg-white/10 rounded-lg p-4 flex flex-col">
      <FifthTitle title="不同学历的招聘信息" size="md" icon="icon-xueli" />
      <div class="grid grid-cols-4 gap-4">
        <Card class="col-span-1">
          <FirstTitle title="不同学历招聘总人数" />
          <GradientBarChart
            height="230px"
            :data="positionData"
            :x-axis-rotate="30"
            :bar-gradient="{
              startColor: '#6dd0ed',
              endColor: '#92e4d0',
            }"
            :grid="{
              top: '15%',
              bottom: '0%',
              left: '3%',
              right: '3%',
            }"
            :label-style="{
              fontSize: 11,
              color: '#6dd0ed',
            }"
            tooltip-title="招聘总人数"
            unit="万"
            quantifier="人"
          />
        </Card>
        <Card class="col-span-1">
          <FirstTitle title="不同学历薪资中位数" />
          <GradientBarChart
            height="230px"
            :data="positionData"
            :x-axis-rotate="30"
            :bar-gradient="{
              startColor: '#fcc316',
              endColor: '#f97316',
            }"
            :grid="{
              top: '15%',
              bottom: '0%',
              left: '3%',
              right: '3%',
            }"
            :label-style="{
              fontSize: 11,
              color: '#fcc316',
            }"
            tooltip-title="薪资中位数"
            quantifier="元"
          />
        </Card>
        <Card class="col-span-1">
          <FirstTitle title="不同学历招聘职位个数" />
          <GradientBarChart
            height="230px"
            :data="positionData"
            :x-axis-rotate="30"
            :bar-gradient="{
              startColor: '#f8f7fa',
              endColor: '#d1b3ff',
            }"
            :grid="{
              top: '15%',
              bottom: '0%',
              left: '3%',
              right: '3%',
            }"
            :label-style="{
              fontSize: 11,
              color: '#d1b3ff',
            }"
            tooltip-title="招聘职位个数"
            unit="万"
            quantifier="个"
          />
        </Card>
        <Card class="col-span-1">
          <FirstTitle title="不同学历招聘单位个数" />
          <GradientBarChart
            height="230px"
            :data="positionData"
            :x-axis-rotate="30"
            :bar-gradient="{
              startColor: '#6db380',
              endColor: '#2e8b57',
            }"
            :grid="{
              top: '15%',
              bottom: '0%',
              left: '3%',
              right: '3%',
            }"
            :label-style="{
              fontSize: 11,
              color: '#6db380',
            }"
            tooltip-title="招聘单位个数"
            quantifier="个"
          />
        </Card>
      </div>
    </div>
  </div>
</template>
